CI4-McFaddan/app/Models/AdminDashboardModel.php

SELECT *
FROM `category`
---
    public function findAllCategories()
    {
        return $this->db->table('category')->get()->getResultArray();

SELECT *
FROM `category`
WHERE `categoryID` = '27'
---
    public function findCategory($id)
    {
        return $this->db->table('category')->where('categoryID', $id)->get()->getRowArray();