CI4-McFaddan/app/Controllers/AdminDashboardController.php

SELECT *
FROM `product`
---
	public function viewProductsDashboard()
{
    $productModel = new AdminDashboardModel();
    $data['products'] = $productModel->findAll();

SELECT *
FROM `member`
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `member`
---
    public function viewMembersDashboard(){
        $members = [ 'members' => $this->adminMemberInfo->paginate(15), //no. of records to display
        'pager' => $this->adminMemberInfo->pager ]; //Pager class info

SELECT *
FROM `staff`
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `staff`
---
    public function viewStaffsDashboard(){
        $staffs = [ 'staffs' => $this->staffMemberInfo->paginate(15), //no. of records to display
        'pager' => $this->staffMemberInfo->pager ]; //Pager class info