CI4-McFaddan/app/Controllers/AdminDashboardController.php

SELECT *
FROM `member`
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `member`
---
    public function viewMembersDashboard(){
        // Check if the user is logged in
        $isLoggedIn = $this->isLoggedIn();
        $userRole = $this->getUserRole();

        if (!$isLoggedIn && $this->getUserRole() == 'member') {
            // Member is not logged in, redirect to errorMemberLogin
            return redirect()->to('MemberController/index');
        }

        // Get session data
        $sessionData = $isLoggedIn ? $this->getMemberSessionDataLogin() : [];

        // Pass $isLoggedIn and $userRole to the view
        $data['isLoggedIn'] = $isLoggedIn;
        $data['userRole'] = $userRole;

        // Pass session data to the view
        $data['email'] = $sessionData['email'] ?? '';
        $data['first_name'] = $sessionData['first_name'] ?? '';
        $data['last_name'] = $sessionData['last_name'] ?? '';
        $data['user_id'] = $sessionData['user_id'] ?? '';

        $members = [ 'members' => $this->adminMemberInfo->paginate(15), //no. of records to display
        'pager' => $this->adminMemberInfo->pager ]; //Pager class info